torvalds/linux/drivers/clk/stm32/stm32mp13_rcc.h
/* RCC_MP_RSTSCLRR register fields */
#define RCC_MP_RSTSCLRR_PORRSTF   BIT(0)
#define RCC_MP_RSTSCLRR_BORRSTF   BIT(1)
#define RCC_MP_RSTSCLRR_PADRSTF   BIT(2)
#define RCC_MP_RSTSCLRR_HCSSRSTF  BIT(3)
#define RCC_MP_RSTSCLRR_VCORERSTF BIT(4)
#define RCC_MP_RSTSCLRR_VCPURSTF  BIT(5)
#define RCC_MP_RSTSCLRR_MPSYSRSTF BIT(6)
#define RCC_MP_RSTSCLRR_IWDG1RSTF BIT(8)
#define RCC_MP_RSTSCLRR_IWDG2RSTF BIT(9)
#define RCC_MP_RSTSCLRR_STP2RSTF  BIT(10)
#define RCC_MP_RSTSCLRR_STDBYRSTF BIT(11)
#define RCC_MP_RSTSCLRR_CSTDBYRSTF  BIT(12)
#define RCC_MP_RSTSCLRR_MPUP0RSTF BIT(13)
#define RCC_MP_RSTSCLRR_SPARE   BIT(15)

/* RCC_MP_IWDGFZSETR register fields */
#define RCC_MP_IWDGFZSETR_FZ_IWDG1  BIT(0)
#define RCC_MP_IWDGFZSETR_FZ_IWDG2  BIT(1)

/* RCC_MP_IWDGFZCLRR register fields */
#define RCC_MP_IWDGFZCLRR_FZ_IWDG1  BIT(0)
#define RCC_MP_IWDGFZCLRR_FZ_IWDG2  BIT(1)

/* RCC_MP_CIER register fields */
#define RCC_MP_CIER_LSIRDYIE    BIT(0)
#define RCC_MP_CIER_LSERDYIE    BIT(1)
#define RCC_MP_CIER_HSIRDYIE    BIT(2)
#define RCC_MP_CIER_HSERDYIE    BIT(3)
#define RCC_MP_CIER_CSIRDYIE    BIT(4)
#define RCC_MP_CIER_PLL1DYIE    BIT(8)
#define RCC_MP_CIER_PLL2DYIE    BIT(9)
#define RCC_MP_CIER_PLL3DYIE    BIT(10)
#define RCC_MP_CIER_PLL4DYIE    BIT(11)
#define RCC_MP_CIER_LSECSSIE    BIT(16)
#define RCC_MP_CIER_WKUPIE    BIT(20)

/* RCC_MP_CIFR register fields */
#define RCC_MP_CIFR_LSIRDYF   BIT(0)
#define RCC_MP_CIFR_LSERDYF   BIT(1)
#define RCC_MP_CIFR_HSIRDYF   BIT(2)
#define RCC_MP_CIFR_HSERDYF   BIT(3)
#define RCC_MP_CIFR_CSIRDYF   BIT(4)
#define RCC_MP_CIFR_PLL1DYF   BIT(8)
#define RCC_MP_CIFR_PLL2DYF   BIT(9)
#define RCC_MP_CIFR_PLL3DYF   BIT(10)
#define RCC_MP_CIFR_PLL4DYF   BIT(11)
#define RCC_MP_CIFR_LSECSSF   BIT(16)
#define RCC_MP_CIFR_WKUPF   BIT(20)

/* RCC_BDCR register fields */
#define RCC_BDCR_LSEON      BIT(0)
#define RCC_BDCR_LSEBYP     BIT(1)
#define RCC_BDCR_LSERDY     BIT(2)
#define RCC_BDCR_DIGBYP     BIT(3)
#define RCC_BDCR_LSEDRV_MASK    GENMASK(5, 4)
#define RCC_BDCR_LSECSSON   BIT(8)
#define RCC_BDCR_LSECSSD    BIT(9)
#define RCC_BDCR_RTCSRC_MASK    GENMASK(17, 16)
#define RCC_BDCR_RTCCKEN    BIT(20)
#define RCC_BDCR_VSWRST     BIT(31)
#define RCC_BDCR_LSEDRV_SHIFT   4
#define RCC_BDCR_RTCSRC_SHIFT   16

/* RCC_RDLSICR register fields */
#define RCC_RDLSICR_LSION   BIT(0)
#define RCC_RDLSICR_LSIRDY    BIT(1)
#define RCC_RDLSICR_MRD_MASK    GENMASK(20, 16)
#define RCC_RDLSICR_EADLY_MASK    GENMASK(26, 24)
#define RCC_RDLSICR_SPARE_MASK    GENMASK(31, 27)
#define RCC_RDLSICR_MRD_SHIFT   16
#define RCC_RDLSICR_EADLY_SHIFT   24
#define RCC_RDLSICR_SPARE_SHIFT   27

/* RCC_OCENSETR register fields */
#define RCC_OCENSETR_HSION    BIT(0)
#define RCC_OCENSETR_HSIKERON   BIT(1)
#define RCC_OCENSETR_CSION    BIT(4)
#define RCC_OCENSETR_CSIKERON   BIT(5)
#define RCC_OCENSETR_DIGBYP   BIT(7)
#define RCC_OCENSETR_HSEON    BIT(8)
#define RCC_OCENSETR_HSEKERON   BIT(9)
#define RCC_OCENSETR_HSEBYP   BIT(10)
#define RCC_OCENSETR_HSECSSON   BIT(11)

/* RCC_OCENCLRR register fields */
#define RCC_OCENCLRR_HSION    BIT(0)
#define RCC_OCENCLRR_HSIKERON   BIT(1)
#define RCC_OCENCLRR_CSION    BIT(4)
#define RCC_OCENCLRR_CSIKERON   BIT(5)
#define RCC_OCENCLRR_DIGBYP   BIT(7)
#define RCC_OCENCLRR_HSEON    BIT(8)
#define RCC_OCENCLRR_HSEKERON   BIT(9)
#define RCC_OCENCLRR_HSEBYP   BIT(10)

/* RCC_OCRDYR register fields */
#define RCC_OCRDYR_HSIRDY   BIT(0)
#define RCC_OCRDYR_HSIDIVRDY    BIT(2)
#define RCC_OCRDYR_CSIRDY   BIT(4)
#define RCC_OCRDYR_HSERDY   BIT(8)
#define RCC_OCRDYR_MPUCKRDY   BIT(23)
#define RCC_OCRDYR_AXICKRDY   BIT(24)

/* RCC_HSICFGR register fields */
#define RCC_HSICFGR_HSIDIV_MASK   GENMASK(1, 0)
#define RCC_HSICFGR_HSITRIM_MASK  GENMASK(14, 8)
#define RCC_HSICFGR_HSICAL_MASK   GENMASK(27, 16)
#define RCC_HSICFGR_HSIDIV_SHIFT  0
#define RCC_HSICFGR_HSITRIM_SHIFT 8
#define RCC_HSICFGR_HSICAL_SHIFT  16

/* RCC_CSICFGR register fields */
#define RCC_CSICFGR_CSITRIM_MASK  GENMASK(12, 8)
#define RCC_CSICFGR_CSICAL_MASK   GENMASK(23, 16)
#define RCC_CSICFGR_CSITRIM_SHIFT 8
#define RCC_CSICFGR_CSICAL_SHIFT  16

/* RCC_MCO1CFGR register fields */
#define RCC_MCO1CFGR_MCO1SEL_MASK GENMASK(2, 0)
#define RCC_MCO1CFGR_MCO1DIV_MASK GENMASK(7, 4)
#define RCC_MCO1CFGR_MCO1ON   BIT(12)
#define RCC_MCO1CFGR_MCO1SEL_SHIFT  0
#define RCC_MCO1CFGR_MCO1DIV_SHIFT  4

/* RCC_MCO2CFGR register fields */
#define RCC_MCO2CFGR_MCO2SEL_MASK GENMASK(2, 0)
#define RCC_MCO2CFGR_MCO2DIV_MASK GENMASK(7, 4)
#define RCC_MCO2CFGR_MCO2ON   BIT(12)
#define RCC_MCO2CFGR_MCO2SEL_SHIFT  0
#define RCC_MCO2CFGR_MCO2DIV_SHIFT  4

/* RCC_DBGCFGR register fields */
#define RCC_DBGCFGR_TRACEDIV_MASK GENMASK(2, 0)
#define RCC_DBGCFGR_DBGCKEN   BIT(8)
#define RCC_DBGCFGR_TRACECKEN   BIT(9)
#define RCC_DBGCFGR_DBGRST    BIT(12)
#define RCC_DBGCFGR_TRACEDIV_SHIFT  0

/* RCC_RCK12SELR register fields */
#define RCC_RCK12SELR_PLL12SRC_MASK GENMASK(1, 0)
#define RCC_RCK12SELR_PLL12SRCRDY BIT(31)
#define RCC_RCK12SELR_PLL12SRC_SHIFT  0

/* RCC_RCK3SELR register fields */
#define RCC_RCK3SELR_PLL3SRC_MASK GENMASK(1, 0)
#define RCC_RCK3SELR_PLL3SRCRDY   BIT(31)
#define RCC_RCK3SELR_PLL3SRC_SHIFT  0

/* RCC_RCK4SELR register fields */
#define RCC_RCK4SELR_PLL4SRC_MASK GENMASK(1, 0)
#define RCC_RCK4SELR_PLL4SRCRDY   BIT(31)
#define RCC_RCK4SELR_PLL4SRC_SHIFT  0

/* RCC_PLL1CR register fields */
#define RCC_PLL1CR_PLLON    BIT(0)
#define RCC_PLL1CR_PLL1RDY    BIT(1)
#define RCC_PLL1CR_SSCG_CTRL    BIT(2)
#define RCC_PLL1CR_DIVPEN   BIT(4)
#define RCC_PLL1CR_DIVQEN   BIT(5)
#define RCC_PLL1CR_DIVREN   BIT(6)

/* RCC_PLL1CFGR1 register fields */
#define RCC_PLL1CFGR1_DIVN_MASK   GENMASK(8, 0)
#define RCC_PLL1CFGR1_DIVM1_MASK  GENMASK(21, 16)
#define RCC_PLL1CFGR1_DIVN_SHIFT  0
#define RCC_PLL1CFGR1_DIVM1_SHIFT 16

/* RCC_PLL1CFGR2 register fields */
#define RCC_PLL1CFGR2_DIVP_MASK   GENMASK(6, 0)
#define RCC_PLL1CFGR2_DIVQ_MASK   GENMASK(14, 8)
#define RCC_PLL1CFGR2_DIVR_MASK   GENMASK(22, 16)
#define RCC_PLL1CFGR2_DIVP_SHIFT  0
#define RCC_PLL1CFGR2_DIVQ_SHIFT  8
#define RCC_PLL1CFGR2_DIVR_SHIFT  16

/* RCC_PLL1FRACR register fields */
#define RCC_PLL1FRACR_FRACV_MASK  GENMASK(15, 3)
#define RCC_PLL1FRACR_FRACLE    BIT(16)
#define RCC_PLL1FRACR_FRACV_SHIFT 3

/* RCC_PLL1CSGR register fields */
#define RCC_PLL1CSGR_MOD_PER_MASK GENMASK(12, 0)
#define RCC_PLL1CSGR_TPDFN_DIS    BIT(13)
#define RCC_PLL1CSGR_RPDFN_DIS    BIT(14)
#define RCC_PLL1CSGR_SSCG_MODE    BIT(15)
#define RCC_PLL1CSGR_INC_STEP_MASK  GENMASK(30, 16)
#define RCC_PLL1CSGR_MOD_PER_SHIFT  0
#define RCC_PLL1CSGR_INC_STEP_SHIFT 16

