torvalds/linux/drivers/clk/stm32/stm32mp13_rcc.h
/* RCC_PLL2CR register fields */
#define RCC_PLL2CR_PLLON    BIT(0)
#define RCC_PLL2CR_PLL2RDY    BIT(1)
#define RCC_PLL2CR_SSCG_CTRL    BIT(2)
#define RCC_PLL2CR_DIVPEN   BIT(4)
#define RCC_PLL2CR_DIVQEN   BIT(5)
#define RCC_PLL2CR_DIVREN   BIT(6)

/* RCC_PLL2CFGR1 register fields */
#define RCC_PLL2CFGR1_DIVN_MASK   GENMASK(8, 0)
#define RCC_PLL2CFGR1_DIVM2_MASK  GENMASK(21, 16)
#define RCC_PLL2CFGR1_DIVN_SHIFT  0
#define RCC_PLL2CFGR1_DIVM2_SHIFT 16

/* RCC_PLL2CFGR2 register fields */
#define RCC_PLL2CFGR2_DIVP_MASK   GENMASK(6, 0)
#define RCC_PLL2CFGR2_DIVQ_MASK   GENMASK(14, 8)
#define RCC_PLL2CFGR2_DIVR_MASK   GENMASK(22, 16)
#define RCC_PLL2CFGR2_DIVP_SHIFT  0
#define RCC_PLL2CFGR2_DIVQ_SHIFT  8
#define RCC_PLL2CFGR2_DIVR_SHIFT  16

/* RCC_PLL2FRACR register fields */
#define RCC_PLL2FRACR_FRACV_MASK  GENMASK(15, 3)
#define RCC_PLL2FRACR_FRACLE    BIT(16)
#define RCC_PLL2FRACR_FRACV_SHIFT 3

/* RCC_PLL2CSGR register fields */
#define RCC_PLL2CSGR_MOD_PER_MASK GENMASK(12, 0)
#define RCC_PLL2CSGR_TPDFN_DIS    BIT(13)
#define RCC_PLL2CSGR_RPDFN_DIS    BIT(14)
#define RCC_PLL2CSGR_SSCG_MODE    BIT(15)
#define RCC_PLL2CSGR_INC_STEP_MASK  GENMASK(30, 16)
#define RCC_PLL2CSGR_MOD_PER_SHIFT  0
#define RCC_PLL2CSGR_INC_STEP_SHIFT 16

/* RCC_PLL3CR register fields */
#define RCC_PLL3CR_PLLON    BIT(0)
#define RCC_PLL3CR_PLL3RDY    BIT(1)
#define RCC_PLL3CR_SSCG_CTRL    BIT(2)
#define RCC_PLL3CR_DIVPEN   BIT(4)
#define RCC_PLL3CR_DIVQEN   BIT(5)
#define RCC_PLL3CR_DIVREN   BIT(6)

/* RCC_PLL3CFGR1 register fields */
#define RCC_PLL3CFGR1_DIVN_MASK   GENMASK(8, 0)
#define RCC_PLL3CFGR1_DIVM3_MASK  GENMASK(21, 16)
#define RCC_PLL3CFGR1_IFRGE_MASK  GENMASK(25, 24)
#define RCC_PLL3CFGR1_DIVN_SHIFT  0
#define RCC_PLL3CFGR1_DIVM3_SHIFT 16
#define RCC_PLL3CFGR1_IFRGE_SHIFT 24

/* RCC_PLL3CFGR2 register fields */
#define RCC_PLL3CFGR2_DIVP_MASK   GENMASK(6, 0)
#define RCC_PLL3CFGR2_DIVQ_MASK   GENMASK(14, 8)
#define RCC_PLL3CFGR2_DIVR_MASK   GENMASK(22, 16)
#define RCC_PLL3CFGR2_DIVP_SHIFT  0
#define RCC_PLL3CFGR2_DIVQ_SHIFT  8
#define RCC_PLL3CFGR2_DIVR_SHIFT  16

/* RCC_PLL3FRACR register fields */
#define RCC_PLL3FRACR_FRACV_MASK  GENMASK(15, 3)
#define RCC_PLL3FRACR_FRACLE    BIT(16)
#define RCC_PLL3FRACR_FRACV_SHIFT 3

/* RCC_PLL3CSGR register fields */
#define RCC_PLL3CSGR_MOD_PER_MASK GENMASK(12, 0)
#define RCC_PLL3CSGR_TPDFN_DIS    BIT(13)
#define RCC_PLL3CSGR_RPDFN_DIS    BIT(14)
#define RCC_PLL3CSGR_SSCG_MODE    BIT(15)
#define RCC_PLL3CSGR_INC_STEP_MASK  GENMASK(30, 16)
#define RCC_PLL3CSGR_MOD_PER_SHIFT  0
#define RCC_PLL3CSGR_INC_STEP_SHIFT 16

/* RCC_PLL4CR register fields */
#define RCC_PLL4CR_PLLON    BIT(0)
#define RCC_PLL4CR_PLL4RDY    BIT(1)
#define RCC_PLL4CR_SSCG_CTRL    BIT(2)
#define RCC_PLL4CR_DIVPEN   BIT(4)
#define RCC_PLL4CR_DIVQEN   BIT(5)
#define RCC_PLL4CR_DIVREN   BIT(6)

/* RCC_PLL4CFGR1 register fields */
#define RCC_PLL4CFGR1_DIVN_MASK   GENMASK(8, 0)
#define RCC_PLL4CFGR1_DIVM4_MASK  GENMASK(21, 16)
#define RCC_PLL4CFGR1_IFRGE_MASK  GENMASK(25, 24)
#define RCC_PLL4CFGR1_DIVN_SHIFT  0
#define RCC_PLL4CFGR1_DIVM4_SHIFT 16
#define RCC_PLL4CFGR1_IFRGE_SHIFT 24

/* RCC_PLL4CFGR2 register fields */
#define RCC_PLL4CFGR2_DIVP_MASK   GENMASK(6, 0)
#define RCC_PLL4CFGR2_DIVQ_MASK   GENMASK(14, 8)
#define RCC_PLL4CFGR2_DIVR_MASK   GENMASK(22, 16)
#define RCC_PLL4CFGR2_DIVP_SHIFT  0
#define RCC_PLL4CFGR2_DIVQ_SHIFT  8
#define RCC_PLL4CFGR2_DIVR_SHIFT  16

/* RCC_PLL4FRACR register fields */
#define RCC_PLL4FRACR_FRACV_MASK  GENMASK(15, 3)
#define RCC_PLL4FRACR_FRACLE    BIT(16)
#define RCC_PLL4FRACR_FRACV_SHIFT 3

/* RCC_PLL4CSGR register fields */
#define RCC_PLL4CSGR_MOD_PER_MASK GENMASK(12, 0)
#define RCC_PLL4CSGR_TPDFN_DIS    BIT(13)
#define RCC_PLL4CSGR_RPDFN_DIS    BIT(14)
#define RCC_PLL4CSGR_SSCG_MODE    BIT(15)
#define RCC_PLL4CSGR_INC_STEP_MASK  GENMASK(30, 16)
#define RCC_PLL4CSGR_MOD_PER_SHIFT  0
#define RCC_PLL4CSGR_INC_STEP_SHIFT 16

/* RCC_MPCKSELR register fields */
#define RCC_MPCKSELR_MPUSRC_MASK  GENMASK(1, 0)
#define RCC_MPCKSELR_MPUSRCRDY    BIT(31)
#define RCC_MPCKSELR_MPUSRC_SHIFT 0

/* RCC_ASSCKSELR register fields */
#define RCC_ASSCKSELR_AXISSRC_MASK  GENMASK(2, 0)
#define RCC_ASSCKSELR_AXISSRCRDY  BIT(31)
#define RCC_ASSCKSELR_AXISSRC_SHIFT 0

/* RCC_MSSCKSELR register fields */
#define RCC_MSSCKSELR_MLAHBSSRC_MASK  GENMASK(1, 0)
#define RCC_MSSCKSELR_MLAHBSSRCRDY  BIT(31)
#define RCC_MSSCKSELR_MLAHBSSRC_SHIFT 0

/* RCC_CPERCKSELR register fields */
#define RCC_CPERCKSELR_CKPERSRC_MASK  GENMASK(1, 0)
#define RCC_CPERCKSELR_CKPERSRC_SHIFT 0

/* RCC_RTCDIVR register fields */
#define RCC_RTCDIVR_RTCDIV_MASK   GENMASK(5, 0)
#define RCC_RTCDIVR_RTCDIV_SHIFT  0

/* RCC_MPCKDIVR register fields */
#define RCC_MPCKDIVR_MPUDIV_MASK  GENMASK(3, 0)
#define RCC_MPCKDIVR_MPUDIVRDY    BIT(31)
#define RCC_MPCKDIVR_MPUDIV_SHIFT 0

/* RCC_AXIDIVR register fields */
#define RCC_AXIDIVR_AXIDIV_MASK   GENMASK(2, 0)
#define RCC_AXIDIVR_AXIDIVRDY   BIT(31)
#define RCC_AXIDIVR_AXIDIV_SHIFT  0

/* RCC_MLAHBDIVR register fields */
#define RCC_MLAHBDIVR_MLAHBDIV_MASK GENMASK(3, 0)
#define RCC_MLAHBDIVR_MLAHBDIVRDY BIT(31)
#define RCC_MLAHBDIVR_MLAHBDIV_SHIFT  0

/* RCC_APB1DIVR register fields */
#define RCC_APB1DIVR_APB1DIV_MASK GENMASK(2, 0)
#define RCC_APB1DIVR_APB1DIVRDY   BIT(31)
#define RCC_APB1DIVR_APB1DIV_SHIFT  0

/* RCC_APB2DIVR register fields */
#define RCC_APB2DIVR_APB2DIV_MASK GENMASK(2, 0)
#define RCC_APB2DIVR_APB2DIVRDY   BIT(31)
#define RCC_APB2DIVR_APB2DIV_SHIFT  0

/* RCC_APB3DIVR register fields */
#define RCC_APB3DIVR_APB3DIV_MASK GENMASK(2, 0)
#define RCC_APB3DIVR_APB3DIVRDY   BIT(31)
#define RCC_APB3DIVR_APB3DIV_SHIFT  0

/* RCC_APB4DIVR register fields */
#define RCC_APB4DIVR_APB4DIV_MASK GENMASK(2, 0)
#define RCC_APB4DIVR_APB4DIVRDY   BIT(31)
#define RCC_APB4DIVR_APB4DIV_SHIFT  0

/* RCC_APB5DIVR register fields */
#define RCC_APB5DIVR_APB5DIV_MASK GENMASK(2, 0)
#define RCC_APB5DIVR_APB5DIVRDY   BIT(31)
#define RCC_APB5DIVR_APB5DIV_SHIFT  0

/* RCC_APB6DIVR register fields */
#define RCC_APB6DIVR_APB6DIV_MASK GENMASK(2, 0)
#define RCC_APB6DIVR_APB6DIVRDY   BIT(31)
#define RCC_APB6DIVR_APB6DIV_SHIFT  0

/* RCC_TIMG1PRER register fields */
#define RCC_TIMG1PRER_TIMG1PRE    BIT(0)
#define RCC_TIMG1PRER_TIMG1PRERDY BIT(31)

/* RCC_TIMG2PRER register fields */
#define RCC_TIMG2PRER_TIMG2PRE    BIT(0)
#define RCC_TIMG2PRER_TIMG2PRERDY BIT(31)

/* RCC_TIMG3PRER register fields */
#define RCC_TIMG3PRER_TIMG3PRE    BIT(0)
#define RCC_TIMG3PRER_TIMG3PRERDY BIT(31)

/* RCC_DDRITFCR register fields */
#define RCC_DDRITFCR_DDRC1EN    BIT(0)
#define RCC_DDRITFCR_DDRC1LPEN    BIT(1)
#define RCC_DDRITFCR_DDRPHYCEN    BIT(4)
#define RCC_DDRITFCR_DDRPHYCLPEN  BIT(5)
#define RCC_DDRITFCR_DDRCAPBEN    BIT(6)
#define RCC_DDRITFCR_DDRCAPBLPEN  BIT(7)
#define RCC_DDRITFCR_AXIDCGEN   BIT(8)
#define RCC_DDRITFCR_DDRPHYCAPBEN BIT(9)
#define RCC_DDRITFCR_DDRPHYCAPBLPEN BIT(10)
#define RCC_DDRITFCR_KERDCG_DLY_MASK  GENMASK(13, 11)
#define RCC_DDRITFCR_DDRCAPBRST   BIT(14)
#define RCC_DDRITFCR_DDRCAXIRST   BIT(15)
#define RCC_DDRITFCR_DDRCORERST   BIT(16)
#define RCC_DDRITFCR_DPHYAPBRST   BIT(17)
#define RCC_DDRITFCR_DPHYRST    BIT(18)
#define RCC_DDRITFCR_DPHYCTLRST   BIT(19)
#define RCC_DDRITFCR_DDRCKMOD_MASK  GENMASK(22, 20)
#define RCC_DDRITFCR_GSKPMOD    BIT(23)
#define RCC_DDRITFCR_GSKPCTRL   BIT(24)
#define RCC_DDRITFCR_DFILP_WIDTH_MASK GENMASK(27, 25)
#define RCC_DDRITFCR_GSKP_DUR_MASK  GENMASK(31, 28)
#define RCC_DDRITFCR_KERDCG_DLY_SHIFT 11
#define RCC_DDRITFCR_DDRCKMOD_SHIFT 20
#define RCC_DDRITFCR_DFILP_WIDTH_SHIFT  25
#define RCC_DDRITFCR_GSKP_DUR_SHIFT 28

