torvalds/linux/drivers/clk/stm32/stm32mp13_rcc.h
/* RCC_I2C12CKSELR register fields */
#define RCC_I2C12CKSELR_I2C12SRC_MASK GENMASK(2, 0)
#define RCC_I2C12CKSELR_I2C12SRC_SHIFT  0

/* RCC_I2C345CKSELR register fields */
#define RCC_I2C345CKSELR_I2C3SRC_MASK GENMASK(2, 0)
#define RCC_I2C345CKSELR_I2C4SRC_MASK GENMASK(5, 3)
#define RCC_I2C345CKSELR_I2C5SRC_MASK GENMASK(8, 6)
#define RCC_I2C345CKSELR_I2C3SRC_SHIFT  0
#define RCC_I2C345CKSELR_I2C4SRC_SHIFT  3
#define RCC_I2C345CKSELR_I2C5SRC_SHIFT  6

/* RCC_SPI2S1CKSELR register fields */
#define RCC_SPI2S1CKSELR_SPI1SRC_MASK GENMASK(2, 0)
#define RCC_SPI2S1CKSELR_SPI1SRC_SHIFT  0

/* RCC_SPI2S23CKSELR register fields */
#define RCC_SPI2S23CKSELR_SPI23SRC_MASK GENMASK(2, 0)
#define RCC_SPI2S23CKSELR_SPI23SRC_SHIFT  0

/* RCC_SPI45CKSELR register fields */
#define RCC_SPI45CKSELR_SPI4SRC_MASK  GENMASK(2, 0)
#define RCC_SPI45CKSELR_SPI5SRC_MASK  GENMASK(5, 3)
#define RCC_SPI45CKSELR_SPI4SRC_SHIFT 0
#define RCC_SPI45CKSELR_SPI5SRC_SHIFT 3

/* RCC_UART12CKSELR register fields */
#define RCC_UART12CKSELR_UART1SRC_MASK  GENMASK(2, 0)
#define RCC_UART12CKSELR_UART2SRC_MASK  GENMASK(5, 3)
#define RCC_UART12CKSELR_UART1SRC_SHIFT 0
#define RCC_UART12CKSELR_UART2SRC_SHIFT 3

/* RCC_UART35CKSELR register fields */
#define RCC_UART35CKSELR_UART35SRC_MASK GENMASK(2, 0)
#define RCC_UART35CKSELR_UART35SRC_SHIFT  0

/* RCC_UART4CKSELR register fields */
#define RCC_UART4CKSELR_UART4SRC_MASK GENMASK(2, 0)
#define RCC_UART4CKSELR_UART4SRC_SHIFT  0

/* RCC_UART6CKSELR register fields */
#define RCC_UART6CKSELR_UART6SRC_MASK GENMASK(2, 0)
#define RCC_UART6CKSELR_UART6SRC_SHIFT  0

/* RCC_UART78CKSELR register fields */
#define RCC_UART78CKSELR_UART78SRC_MASK GENMASK(2, 0)
#define RCC_UART78CKSELR_UART78SRC_SHIFT  0

/* RCC_LPTIM1CKSELR register fields */
#define RCC_LPTIM1CKSELR_LPTIM1SRC_MASK GENMASK(2, 0)
#define RCC_LPTIM1CKSELR_LPTIM1SRC_SHIFT  0

/* RCC_LPTIM23CKSELR register fields */
#define RCC_LPTIM23CKSELR_LPTIM2SRC_MASK  GENMASK(2, 0)
#define RCC_LPTIM23CKSELR_LPTIM3SRC_MASK  GENMASK(5, 3)
#define RCC_LPTIM23CKSELR_LPTIM2SRC_SHIFT 0
#define RCC_LPTIM23CKSELR_LPTIM3SRC_SHIFT 3

/* RCC_LPTIM45CKSELR register fields */
#define RCC_LPTIM45CKSELR_LPTIM45SRC_MASK GENMASK(2, 0)
#define RCC_LPTIM45CKSELR_LPTIM45SRC_SHIFT  0

/* RCC_SAI1CKSELR register fields */
#define RCC_SAI1CKSELR_SAI1SRC_MASK GENMASK(2, 0)
#define RCC_SAI1CKSELR_SAI1SRC_SHIFT  0

/* RCC_SAI2CKSELR register fields */
#define RCC_SAI2CKSELR_SAI2SRC_MASK GENMASK(2, 0)
#define RCC_SAI2CKSELR_SAI2SRC_SHIFT  0

/* RCC_FDCANCKSELR register fields */
#define RCC_FDCANCKSELR_FDCANSRC_MASK GENMASK(1, 0)
#define RCC_FDCANCKSELR_FDCANSRC_SHIFT  0

/* RCC_SPDIFCKSELR register fields */
#define RCC_SPDIFCKSELR_SPDIFSRC_MASK GENMASK(1, 0)
#define RCC_SPDIFCKSELR_SPDIFSRC_SHIFT  0

/* RCC_ADC12CKSELR register fields */
#define RCC_ADC12CKSELR_ADC1SRC_MASK  GENMASK(1, 0)
#define RCC_ADC12CKSELR_ADC2SRC_MASK  GENMASK(3, 2)
#define RCC_ADC12CKSELR_ADC1SRC_SHIFT 0
#define RCC_ADC12CKSELR_ADC2SRC_SHIFT 2

/* RCC_SDMMC12CKSELR register fields */
#define RCC_SDMMC12CKSELR_SDMMC1SRC_MASK  GENMASK(2, 0)
#define RCC_SDMMC12CKSELR_SDMMC2SRC_MASK  GENMASK(5, 3)
#define RCC_SDMMC12CKSELR_SDMMC1SRC_SHIFT 0
#define RCC_SDMMC12CKSELR_SDMMC2SRC_SHIFT 3

/* RCC_ETH12CKSELR register fields */
#define RCC_ETH12CKSELR_ETH1SRC_MASK  GENMASK(1, 0)
#define RCC_ETH12CKSELR_ETH1PTPDIV_MASK GENMASK(7, 4)
#define RCC_ETH12CKSELR_ETH2SRC_MASK  GENMASK(9, 8)
#define RCC_ETH12CKSELR_ETH2PTPDIV_MASK GENMASK(15, 12)
#define RCC_ETH12CKSELR_ETH1SRC_SHIFT 0
#define RCC_ETH12CKSELR_ETH1PTPDIV_SHIFT  4
#define RCC_ETH12CKSELR_ETH2SRC_SHIFT 8
#define RCC_ETH12CKSELR_ETH2PTPDIV_SHIFT  12

/* RCC_USBCKSELR register fields */
#define RCC_USBCKSELR_USBPHYSRC_MASK  GENMASK(1, 0)
#define RCC_USBCKSELR_USBOSRC   BIT(4)
#define RCC_USBCKSELR_USBPHYSRC_SHIFT 0

/* RCC_QSPICKSELR register fields */
#define RCC_QSPICKSELR_QSPISRC_MASK GENMASK(1, 0)
#define RCC_QSPICKSELR_QSPISRC_SHIFT  0

/* RCC_FMCCKSELR register fields */
#define RCC_FMCCKSELR_FMCSRC_MASK GENMASK(1, 0)
#define RCC_FMCCKSELR_FMCSRC_SHIFT  0

/* RCC_RNG1CKSELR register fields */
#define RCC_RNG1CKSELR_RNG1SRC_MASK GENMASK(1, 0)
#define RCC_RNG1CKSELR_RNG1SRC_SHIFT  0

/* RCC_STGENCKSELR register fields */
#define RCC_STGENCKSELR_STGENSRC_MASK GENMASK(1, 0)
#define RCC_STGENCKSELR_STGENSRC_SHIFT  0

/* RCC_DCMIPPCKSELR register fields */
#define RCC_DCMIPPCKSELR_DCMIPPSRC_MASK GENMASK(1, 0)
#define RCC_DCMIPPCKSELR_DCMIPPSRC_SHIFT  0

/* RCC_SAESCKSELR register fields */
#define RCC_SAESCKSELR_SAESSRC_MASK GENMASK(1, 0)
#define RCC_SAESCKSELR_SAESSRC_SHIFT  0

/* RCC_APB1RSTSETR register fields */
#define RCC_APB1RSTSETR_TIM2RST   BIT(0)
#define RCC_APB1RSTSETR_TIM3RST   BIT(1)
#define RCC_APB1RSTSETR_TIM4RST   BIT(2)
#define RCC_APB1RSTSETR_TIM5RST   BIT(3)
#define RCC_APB1RSTSETR_TIM6RST   BIT(4)
#define RCC_APB1RSTSETR_TIM7RST   BIT(5)
#define RCC_APB1RSTSETR_LPTIM1RST BIT(9)
#define RCC_APB1RSTSETR_SPI2RST   BIT(11)
#define RCC_APB1RSTSETR_SPI3RST   BIT(12)
#define RCC_APB1RSTSETR_USART3RST BIT(15)
#define RCC_APB1RSTSETR_UART4RST  BIT(16)
#define RCC_APB1RSTSETR_UART5RST  BIT(17)
#define RCC_APB1RSTSETR_UART7RST  BIT(18)
#define RCC_APB1RSTSETR_UART8RST  BIT(19)
#define RCC_APB1RSTSETR_I2C1RST   BIT(21)
#define RCC_APB1RSTSETR_I2C2RST   BIT(22)
#define RCC_APB1RSTSETR_SPDIFRST  BIT(26)

/* RCC_APB1RSTCLRR register fields */
#define RCC_APB1RSTCLRR_TIM2RST   BIT(0)
#define RCC_APB1RSTCLRR_TIM3RST   BIT(1)
#define RCC_APB1RSTCLRR_TIM4RST   BIT(2)
#define RCC_APB1RSTCLRR_TIM5RST   BIT(3)
#define RCC_APB1RSTCLRR_TIM6RST   BIT(4)
#define RCC_APB1RSTCLRR_TIM7RST   BIT(5)
#define RCC_APB1RSTCLRR_LPTIM1RST BIT(9)
#define RCC_APB1RSTCLRR_SPI2RST   BIT(11)
#define RCC_APB1RSTCLRR_SPI3RST   BIT(12)
#define RCC_APB1RSTCLRR_USART3RST BIT(15)
#define RCC_APB1RSTCLRR_UART4RST  BIT(16)
#define RCC_APB1RSTCLRR_UART5RST  BIT(17)
#define RCC_APB1RSTCLRR_UART7RST  BIT(18)
#define RCC_APB1RSTCLRR_UART8RST  BIT(19)
#define RCC_APB1RSTCLRR_I2C1RST   BIT(21)
#define RCC_APB1RSTCLRR_I2C2RST   BIT(22)
#define RCC_APB1RSTCLRR_SPDIFRST  BIT(26)

/* RCC_APB2RSTSETR register fields */
#define RCC_APB2RSTSETR_TIM1RST   BIT(0)
#define RCC_APB2RSTSETR_TIM8RST   BIT(1)
#define RCC_APB2RSTSETR_SPI1RST   BIT(8)
#define RCC_APB2RSTSETR_USART6RST BIT(13)
#define RCC_APB2RSTSETR_SAI1RST   BIT(16)
#define RCC_APB2RSTSETR_SAI2RST   BIT(17)
#define RCC_APB2RSTSETR_DFSDMRST  BIT(20)
#define RCC_APB2RSTSETR_FDCANRST  BIT(24)

/* RCC_APB2RSTCLRR register fields */
#define RCC_APB2RSTCLRR_TIM1RST   BIT(0)
#define RCC_APB2RSTCLRR_TIM8RST   BIT(1)
#define RCC_APB2RSTCLRR_SPI1RST   BIT(8)
#define RCC_APB2RSTCLRR_USART6RST BIT(13)
#define RCC_APB2RSTCLRR_SAI1RST   BIT(16)
#define RCC_APB2RSTCLRR_SAI2RST   BIT(17)
#define RCC_APB2RSTCLRR_DFSDMRST  BIT(20)
#define RCC_APB2RSTCLRR_FDCANRST  BIT(24)

