torvalds/linux/drivers/clk/stm32/stm32mp13_rcc.h
/* RCC_APB3RSTSETR register fields */
#define RCC_APB3RSTSETR_LPTIM2RST BIT(0)
#define RCC_APB3RSTSETR_LPTIM3RST BIT(1)
#define RCC_APB3RSTSETR_LPTIM4RST BIT(2)
#define RCC_APB3RSTSETR_LPTIM5RST BIT(3)
#define RCC_APB3RSTSETR_SYSCFGRST BIT(11)
#define RCC_APB3RSTSETR_VREFRST   BIT(13)
#define RCC_APB3RSTSETR_DTSRST    BIT(16)
#define RCC_APB3RSTSETR_PMBCTRLRST  BIT(17)

/* RCC_APB3RSTCLRR register fields */
#define RCC_APB3RSTCLRR_LPTIM2RST BIT(0)
#define RCC_APB3RSTCLRR_LPTIM3RST BIT(1)
#define RCC_APB3RSTCLRR_LPTIM4RST BIT(2)
#define RCC_APB3RSTCLRR_LPTIM5RST BIT(3)
#define RCC_APB3RSTCLRR_SYSCFGRST BIT(11)
#define RCC_APB3RSTCLRR_VREFRST   BIT(13)
#define RCC_APB3RSTCLRR_DTSRST    BIT(16)
#define RCC_APB3RSTCLRR_PMBCTRLRST  BIT(17)

/* RCC_APB4RSTSETR register fields */
#define RCC_APB4RSTSETR_LTDCRST   BIT(0)
#define RCC_APB4RSTSETR_DCMIPPRST BIT(1)
#define RCC_APB4RSTSETR_DDRPERFMRST BIT(8)
#define RCC_APB4RSTSETR_USBPHYRST BIT(16)

/* RCC_APB4RSTCLRR register fields */
#define RCC_APB4RSTCLRR_LTDCRST   BIT(0)
#define RCC_APB4RSTCLRR_DCMIPPRST BIT(1)
#define RCC_APB4RSTCLRR_DDRPERFMRST BIT(8)
#define RCC_APB4RSTCLRR_USBPHYRST BIT(16)

/* RCC_APB5RSTSETR register fields */
#define RCC_APB5RSTSETR_STGENRST  BIT(20)

/* RCC_APB5RSTCLRR register fields */
#define RCC_APB5RSTCLRR_STGENRST  BIT(20)

/* RCC_APB6RSTSETR register fields */
#define RCC_APB6RSTSETR_USART1RST BIT(0)
#define RCC_APB6RSTSETR_USART2RST BIT(1)
#define RCC_APB6RSTSETR_SPI4RST   BIT(2)
#define RCC_APB6RSTSETR_SPI5RST   BIT(3)
#define RCC_APB6RSTSETR_I2C3RST   BIT(4)
#define RCC_APB6RSTSETR_I2C4RST   BIT(5)
#define RCC_APB6RSTSETR_I2C5RST   BIT(6)
#define RCC_APB6RSTSETR_TIM12RST  BIT(7)
#define RCC_APB6RSTSETR_TIM13RST  BIT(8)
#define RCC_APB6RSTSETR_TIM14RST  BIT(9)
#define RCC_APB6RSTSETR_TIM15RST  BIT(10)
#define RCC_APB6RSTSETR_TIM16RST  BIT(11)
#define RCC_APB6RSTSETR_TIM17RST  BIT(12)

/* RCC_APB6RSTCLRR register fields */
#define RCC_APB6RSTCLRR_USART1RST BIT(0)
#define RCC_APB6RSTCLRR_USART2RST BIT(1)
#define RCC_APB6RSTCLRR_SPI4RST   BIT(2)
#define RCC_APB6RSTCLRR_SPI5RST   BIT(3)
#define RCC_APB6RSTCLRR_I2C3RST   BIT(4)
#define RCC_APB6RSTCLRR_I2C4RST   BIT(5)
#define RCC_APB6RSTCLRR_I2C5RST   BIT(6)
#define RCC_APB6RSTCLRR_TIM12RST  BIT(7)
#define RCC_APB6RSTCLRR_TIM13RST  BIT(8)
#define RCC_APB6RSTCLRR_TIM14RST  BIT(9)
#define RCC_APB6RSTCLRR_TIM15RST  BIT(10)
#define RCC_APB6RSTCLRR_TIM16RST  BIT(11)
#define RCC_APB6RSTCLRR_TIM17RST  BIT(12)

/* RCC_AHB2RSTSETR register fields */
#define RCC_AHB2RSTSETR_DMA1RST   BIT(0)
#define RCC_AHB2RSTSETR_DMA2RST   BIT(1)
#define RCC_AHB2RSTSETR_DMAMUX1RST  BIT(2)
#define RCC_AHB2RSTSETR_DMA3RST   BIT(3)
#define RCC_AHB2RSTSETR_DMAMUX2RST  BIT(4)
#define RCC_AHB2RSTSETR_ADC1RST   BIT(5)
#define RCC_AHB2RSTSETR_ADC2RST   BIT(6)
#define RCC_AHB2RSTSETR_USBORST   BIT(8)

/* RCC_AHB2RSTCLRR register fields */
#define RCC_AHB2RSTCLRR_DMA1RST   BIT(0)
#define RCC_AHB2RSTCLRR_DMA2RST   BIT(1)
#define RCC_AHB2RSTCLRR_DMAMUX1RST  BIT(2)
#define RCC_AHB2RSTCLRR_DMA3RST   BIT(3)
#define RCC_AHB2RSTCLRR_DMAMUX2RST  BIT(4)
#define RCC_AHB2RSTCLRR_ADC1RST   BIT(5)
#define RCC_AHB2RSTCLRR_ADC2RST   BIT(6)
#define RCC_AHB2RSTCLRR_USBORST   BIT(8)

/* RCC_AHB4RSTSETR register fields */
#define RCC_AHB4RSTSETR_GPIOARST  BIT(0)
#define RCC_AHB4RSTSETR_GPIOBRST  BIT(1)
#define RCC_AHB4RSTSETR_GPIOCRST  BIT(2)
#define RCC_AHB4RSTSETR_GPIODRST  BIT(3)
#define RCC_AHB4RSTSETR_GPIOERST  BIT(4)
#define RCC_AHB4RSTSETR_GPIOFRST  BIT(5)
#define RCC_AHB4RSTSETR_GPIOGRST  BIT(6)
#define RCC_AHB4RSTSETR_GPIOHRST  BIT(7)
#define RCC_AHB4RSTSETR_GPIOIRST  BIT(8)
#define RCC_AHB4RSTSETR_TSCRST    BIT(15)

/* RCC_AHB4RSTCLRR register fields */
#define RCC_AHB4RSTCLRR_GPIOARST  BIT(0)
#define RCC_AHB4RSTCLRR_GPIOBRST  BIT(1)
#define RCC_AHB4RSTCLRR_GPIOCRST  BIT(2)
#define RCC_AHB4RSTCLRR_GPIODRST  BIT(3)
#define RCC_AHB4RSTCLRR_GPIOERST  BIT(4)
#define RCC_AHB4RSTCLRR_GPIOFRST  BIT(5)
#define RCC_AHB4RSTCLRR_GPIOGRST  BIT(6)
#define RCC_AHB4RSTCLRR_GPIOHRST  BIT(7)
#define RCC_AHB4RSTCLRR_GPIOIRST  BIT(8)
#define RCC_AHB4RSTCLRR_TSCRST    BIT(15)

/* RCC_AHB5RSTSETR register fields */
#define RCC_AHB5RSTSETR_PKARST    BIT(2)
#define RCC_AHB5RSTSETR_SAESRST   BIT(3)
#define RCC_AHB5RSTSETR_CRYP1RST  BIT(4)
#define RCC_AHB5RSTSETR_HASH1RST  BIT(5)
#define RCC_AHB5RSTSETR_RNG1RST   BIT(6)
#define RCC_AHB5RSTSETR_AXIMCRST  BIT(16)

/* RCC_AHB5RSTCLRR register fields */
#define RCC_AHB5RSTCLRR_PKARST    BIT(2)
#define RCC_AHB5RSTCLRR_SAESRST   BIT(3)
#define RCC_AHB5RSTCLRR_CRYP1RST  BIT(4)
#define RCC_AHB5RSTCLRR_HASH1RST  BIT(5)
#define RCC_AHB5RSTCLRR_RNG1RST   BIT(6)
#define RCC_AHB5RSTCLRR_AXIMCRST  BIT(16)

/* RCC_AHB6RSTSETR register fields */
#define RCC_AHB6RSTSETR_MDMARST   BIT(0)
#define RCC_AHB6RSTSETR_MCERST    BIT(1)
#define RCC_AHB6RSTSETR_ETH1MACRST  BIT(10)
#define RCC_AHB6RSTSETR_FMCRST    BIT(12)
#define RCC_AHB6RSTSETR_QSPIRST   BIT(14)
#define RCC_AHB6RSTSETR_SDMMC1RST BIT(16)
#define RCC_AHB6RSTSETR_SDMMC2RST BIT(17)
#define RCC_AHB6RSTSETR_CRC1RST   BIT(20)
#define RCC_AHB6RSTSETR_USBHRST   BIT(24)
#define RCC_AHB6RSTSETR_ETH2MACRST  BIT(30)

/* RCC_AHB6RSTCLRR register fields */
#define RCC_AHB6RSTCLRR_MDMARST   BIT(0)
#define RCC_AHB6RSTCLRR_MCERST    BIT(1)
#define RCC_AHB6RSTCLRR_ETH1MACRST  BIT(10)
#define RCC_AHB6RSTCLRR_FMCRST    BIT(12)
#define RCC_AHB6RSTCLRR_QSPIRST   BIT(14)
#define RCC_AHB6RSTCLRR_SDMMC1RST BIT(16)
#define RCC_AHB6RSTCLRR_SDMMC2RST BIT(17)
#define RCC_AHB6RSTCLRR_CRC1RST   BIT(20)
#define RCC_AHB6RSTCLRR_USBHRST   BIT(24)
#define RCC_AHB6RSTCLRR_ETH2MACRST  BIT(30)

/* RCC_MP_APB1ENSETR register fields */
#define RCC_MP_APB1ENSETR_TIM2EN  BIT(0)
#define RCC_MP_APB1ENSETR_TIM3EN  BIT(1)
#define RCC_MP_APB1ENSETR_TIM4EN  BIT(2)
#define RCC_MP_APB1ENSETR_TIM5EN  BIT(3)
#define RCC_MP_APB1ENSETR_TIM6EN  BIT(4)
#define RCC_MP_APB1ENSETR_TIM7EN  BIT(5)
#define RCC_MP_APB1ENSETR_LPTIM1EN  BIT(9)
#define RCC_MP_APB1ENSETR_SPI2EN  BIT(11)
#define RCC_MP_APB1ENSETR_SPI3EN  BIT(12)
#define RCC_MP_APB1ENSETR_USART3EN  BIT(15)
#define RCC_MP_APB1ENSETR_UART4EN BIT(16)
#define RCC_MP_APB1ENSETR_UART5EN BIT(17)
#define RCC_MP_APB1ENSETR_UART7EN BIT(18)
#define RCC_MP_APB1ENSETR_UART8EN BIT(19)
#define RCC_MP_APB1ENSETR_I2C1EN  BIT(21)
#define RCC_MP_APB1ENSETR_I2C2EN  BIT(22)
#define RCC_MP_APB1ENSETR_SPDIFEN BIT(26)

/* RCC_MP_APB1ENCLRR register fields */
#define RCC_MP_APB1ENCLRR_TIM2EN  BIT(0)
#define RCC_MP_APB1ENCLRR_TIM3EN  BIT(1)
#define RCC_MP_APB1ENCLRR_TIM4EN  BIT(2)
#define RCC_MP_APB1ENCLRR_TIM5EN  BIT(3)
#define RCC_MP_APB1ENCLRR_TIM6EN  BIT(4)
#define RCC_MP_APB1ENCLRR_TIM7EN  BIT(5)
#define RCC_MP_APB1ENCLRR_LPTIM1EN  BIT(9)
#define RCC_MP_APB1ENCLRR_SPI2EN  BIT(11)
#define RCC_MP_APB1ENCLRR_SPI3EN  BIT(12)
#define RCC_MP_APB1ENCLRR_USART3EN  BIT(15)
#define RCC_MP_APB1ENCLRR_UART4EN BIT(16)
#define RCC_MP_APB1ENCLRR_UART5EN BIT(17)
#define RCC_MP_APB1ENCLRR_UART7EN BIT(18)
#define RCC_MP_APB1ENCLRR_UART8EN BIT(19)
#define RCC_MP_APB1ENCLRR_I2C1EN  BIT(21)
#define RCC_MP_APB1ENCLRR_I2C2EN  BIT(22)
#define RCC_MP_APB1ENCLRR_SPDIFEN BIT(26)

