torvalds/linux/drivers/clk/stm32/stm32mp13_rcc.h
/* RCC_MP_APB2ENSETR register fields */
#define RCC_MP_APB2ENSETR_TIM1EN  BIT(0)
#define RCC_MP_APB2ENSETR_TIM8EN  BIT(1)
#define RCC_MP_APB2ENSETR_SPI1EN  BIT(8)
#define RCC_MP_APB2ENSETR_USART6EN  BIT(13)
#define RCC_MP_APB2ENSETR_SAI1EN  BIT(16)
#define RCC_MP_APB2ENSETR_SAI2EN  BIT(17)
#define RCC_MP_APB2ENSETR_DFSDMEN BIT(20)
#define RCC_MP_APB2ENSETR_ADFSDMEN  BIT(21)
#define RCC_MP_APB2ENSETR_FDCANEN BIT(24)

/* RCC_MP_APB2ENCLRR register fields */
#define RCC_MP_APB2ENCLRR_TIM1EN  BIT(0)
#define RCC_MP_APB2ENCLRR_TIM8EN  BIT(1)
#define RCC_MP_APB2ENCLRR_SPI1EN  BIT(8)
#define RCC_MP_APB2ENCLRR_USART6EN  BIT(13)
#define RCC_MP_APB2ENCLRR_SAI1EN  BIT(16)
#define RCC_MP_APB2ENCLRR_SAI2EN  BIT(17)
#define RCC_MP_APB2ENCLRR_DFSDMEN BIT(20)
#define RCC_MP_APB2ENCLRR_ADFSDMEN  BIT(21)
#define RCC_MP_APB2ENCLRR_FDCANEN BIT(24)

/* RCC_MP_APB3ENSETR register fields */
#define RCC_MP_APB3ENSETR_LPTIM2EN  BIT(0)
#define RCC_MP_APB3ENSETR_LPTIM3EN  BIT(1)
#define RCC_MP_APB3ENSETR_LPTIM4EN  BIT(2)
#define RCC_MP_APB3ENSETR_LPTIM5EN  BIT(3)
#define RCC_MP_APB3ENSETR_VREFEN  BIT(13)
#define RCC_MP_APB3ENSETR_DTSEN   BIT(16)
#define RCC_MP_APB3ENSETR_PMBCTRLEN BIT(17)
#define RCC_MP_APB3ENSETR_HDPEN   BIT(20)

/* RCC_MP_APB3ENCLRR register fields */
#define RCC_MP_APB3ENCLRR_LPTIM2EN  BIT(0)
#define RCC_MP_APB3ENCLRR_LPTIM3EN  BIT(1)
#define RCC_MP_APB3ENCLRR_LPTIM4EN  BIT(2)
#define RCC_MP_APB3ENCLRR_LPTIM5EN  BIT(3)
#define RCC_MP_APB3ENCLRR_VREFEN  BIT(13)
#define RCC_MP_APB3ENCLRR_DTSEN   BIT(16)
#define RCC_MP_APB3ENCLRR_PMBCTRLEN BIT(17)
#define RCC_MP_APB3ENCLRR_HDPEN   BIT(20)

/* RCC_MP_S_APB3ENSETR register fields */
#define RCC_MP_S_APB3ENSETR_SYSCFGEN  BIT(0)

/* RCC_MP_S_APB3ENCLRR register fields */
#define RCC_MP_S_APB3ENCLRR_SYSCFGEN  BIT(0)

/* RCC_MP_NS_APB3ENSETR register fields */
#define RCC_MP_NS_APB3ENSETR_SYSCFGEN BIT(0)

/* RCC_MP_NS_APB3ENCLRR register fields */
#define RCC_MP_NS_APB3ENCLRR_SYSCFGEN BIT(0)

/* RCC_MP_APB4ENSETR register fields */
#define RCC_MP_APB4ENSETR_DCMIPPEN  BIT(1)
#define RCC_MP_APB4ENSETR_DDRPERFMEN  BIT(8)
#define RCC_MP_APB4ENSETR_IWDG2APBEN  BIT(15)
#define RCC_MP_APB4ENSETR_USBPHYEN  BIT(16)
#define RCC_MP_APB4ENSETR_STGENROEN BIT(20)

/* RCC_MP_APB4ENCLRR register fields */
#define RCC_MP_APB4ENCLRR_DCMIPPEN  BIT(1)
#define RCC_MP_APB4ENCLRR_DDRPERFMEN  BIT(8)
#define RCC_MP_APB4ENCLRR_IWDG2APBEN  BIT(15)
#define RCC_MP_APB4ENCLRR_USBPHYEN  BIT(16)
#define RCC_MP_APB4ENCLRR_STGENROEN BIT(20)

/* RCC_MP_S_APB4ENSETR register fields */
#define RCC_MP_S_APB4ENSETR_LTDCEN  BIT(0)

/* RCC_MP_S_APB4ENCLRR register fields */
#define RCC_MP_S_APB4ENCLRR_LTDCEN  BIT(0)

/* RCC_MP_NS_APB4ENSETR register fields */
#define RCC_MP_NS_APB4ENSETR_LTDCEN BIT(0)

/* RCC_MP_NS_APB4ENCLRR register fields */
#define RCC_MP_NS_APB4ENCLRR_LTDCEN BIT(0)

/* RCC_MP_APB5ENSETR register fields */
#define RCC_MP_APB5ENSETR_RTCAPBEN  BIT(8)
#define RCC_MP_APB5ENSETR_TZCEN   BIT(11)
#define RCC_MP_APB5ENSETR_ETZPCEN BIT(13)
#define RCC_MP_APB5ENSETR_IWDG1APBEN  BIT(15)
#define RCC_MP_APB5ENSETR_BSECEN  BIT(16)
#define RCC_MP_APB5ENSETR_STGENCEN  BIT(20)

/* RCC_MP_APB5ENCLRR register fields */
#define RCC_MP_APB5ENCLRR_RTCAPBEN  BIT(8)
#define RCC_MP_APB5ENCLRR_TZCEN   BIT(11)
#define RCC_MP_APB5ENCLRR_ETZPCEN BIT(13)
#define RCC_MP_APB5ENCLRR_IWDG1APBEN  BIT(15)
#define RCC_MP_APB5ENCLRR_BSECEN  BIT(16)
#define RCC_MP_APB5ENCLRR_STGENCEN  BIT(20)

/* RCC_MP_APB6ENSETR register fields */
#define RCC_MP_APB6ENSETR_USART1EN  BIT(0)
#define RCC_MP_APB6ENSETR_USART2EN  BIT(1)
#define RCC_MP_APB6ENSETR_SPI4EN  BIT(2)
#define RCC_MP_APB6ENSETR_SPI5EN  BIT(3)
#define RCC_MP_APB6ENSETR_I2C3EN  BIT(4)
#define RCC_MP_APB6ENSETR_I2C4EN  BIT(5)
#define RCC_MP_APB6ENSETR_I2C5EN  BIT(6)
#define RCC_MP_APB6ENSETR_TIM12EN BIT(7)
#define RCC_MP_APB6ENSETR_TIM13EN BIT(8)
#define RCC_MP_APB6ENSETR_TIM14EN BIT(9)
#define RCC_MP_APB6ENSETR_TIM15EN BIT(10)
#define RCC_MP_APB6ENSETR_TIM16EN BIT(11)
#define RCC_MP_APB6ENSETR_TIM17EN BIT(12)

/* RCC_MP_APB6ENCLRR register fields */
#define RCC_MP_APB6ENCLRR_USART1EN  BIT(0)
#define RCC_MP_APB6ENCLRR_USART2EN  BIT(1)
#define RCC_MP_APB6ENCLRR_SPI4EN  BIT(2)
#define RCC_MP_APB6ENCLRR_SPI5EN  BIT(3)
#define RCC_MP_APB6ENCLRR_I2C3EN  BIT(4)
#define RCC_MP_APB6ENCLRR_I2C4EN  BIT(5)
#define RCC_MP_APB6ENCLRR_I2C5EN  BIT(6)
#define RCC_MP_APB6ENCLRR_TIM12EN BIT(7)
#define RCC_MP_APB6ENCLRR_TIM13EN BIT(8)
#define RCC_MP_APB6ENCLRR_TIM14EN BIT(9)
#define RCC_MP_APB6ENCLRR_TIM15EN BIT(10)
#define RCC_MP_APB6ENCLRR_TIM16EN BIT(11)
#define RCC_MP_APB6ENCLRR_TIM17EN BIT(12)

/* RCC_MP_AHB2ENSETR register fields */
#define RCC_MP_AHB2ENSETR_DMA1EN  BIT(0)
#define RCC_MP_AHB2ENSETR_DMA2EN  BIT(1)
#define RCC_MP_AHB2ENSETR_DMAMUX1EN BIT(2)
#define RCC_MP_AHB2ENSETR_DMA3EN  BIT(3)
#define RCC_MP_AHB2ENSETR_DMAMUX2EN BIT(4)
#define RCC_MP_AHB2ENSETR_ADC1EN  BIT(5)
#define RCC_MP_AHB2ENSETR_ADC2EN  BIT(6)
#define RCC_MP_AHB2ENSETR_USBOEN  BIT(8)

/* RCC_MP_AHB2ENCLRR register fields */
#define RCC_MP_AHB2ENCLRR_DMA1EN  BIT(0)
#define RCC_MP_AHB2ENCLRR_DMA2EN  BIT(1)
#define RCC_MP_AHB2ENCLRR_DMAMUX1EN BIT(2)
#define RCC_MP_AHB2ENCLRR_DMA3EN  BIT(3)
#define RCC_MP_AHB2ENCLRR_DMAMUX2EN BIT(4)
#define RCC_MP_AHB2ENCLRR_ADC1EN  BIT(5)
#define RCC_MP_AHB2ENCLRR_ADC2EN  BIT(6)
#define RCC_MP_AHB2ENCLRR_USBOEN  BIT(8)

/* RCC_MP_AHB4ENSETR register fields */
#define RCC_MP_AHB4ENSETR_TSCEN   BIT(15)

/* RCC_MP_AHB4ENCLRR register fields */
#define RCC_MP_AHB4ENCLRR_TSCEN   BIT(15)

/* RCC_MP_S_AHB4ENSETR register fields */
#define RCC_MP_S_AHB4ENSETR_GPIOAEN BIT(0)
#define RCC_MP_S_AHB4ENSETR_GPIOBEN BIT(1)
#define RCC_MP_S_AHB4ENSETR_GPIOCEN BIT(2)
#define RCC_MP_S_AHB4ENSETR_GPIODEN BIT(3)
#define RCC_MP_S_AHB4ENSETR_GPIOEEN BIT(4)
#define RCC_MP_S_AHB4ENSETR_GPIOFEN BIT(5)
#define RCC_MP_S_AHB4ENSETR_GPIOGEN BIT(6)
#define RCC_MP_S_AHB4ENSETR_GPIOHEN BIT(7)
#define RCC_MP_S_AHB4ENSETR_GPIOIEN BIT(8)

/* RCC_MP_S_AHB4ENCLRR register fields */
#define RCC_MP_S_AHB4ENCLRR_GPIOAEN BIT(0)
#define RCC_MP_S_AHB4ENCLRR_GPIOBEN BIT(1)
#define RCC_MP_S_AHB4ENCLRR_GPIOCEN BIT(2)
#define RCC_MP_S_AHB4ENCLRR_GPIODEN BIT(3)
#define RCC_MP_S_AHB4ENCLRR_GPIOEEN BIT(4)
#define RCC_MP_S_AHB4ENCLRR_GPIOFEN BIT(5)
#define RCC_MP_S_AHB4ENCLRR_GPIOGEN BIT(6)
#define RCC_MP_S_AHB4ENCLRR_GPIOHEN BIT(7)
#define RCC_MP_S_AHB4ENCLRR_GPIOIEN BIT(8)

/* RCC_MP_NS_AHB4ENSETR register fields */
#define RCC_MP_NS_AHB4ENSETR_GPIOAEN  BIT(0)
#define RCC_MP_NS_AHB4ENSETR_GPIOBEN  BIT(1)
#define RCC_MP_NS_AHB4ENSETR_GPIOCEN  BIT(2)
#define RCC_MP_NS_AHB4ENSETR_GPIODEN  BIT(3)
#define RCC_MP_NS_AHB4ENSETR_GPIOEEN  BIT(4)
#define RCC_MP_NS_AHB4ENSETR_GPIOFEN  BIT(5)
#define RCC_MP_NS_AHB4ENSETR_GPIOGEN  BIT(6)
#define RCC_MP_NS_AHB4ENSETR_GPIOHEN  BIT(7)
#define RCC_MP_NS_AHB4ENSETR_GPIOIEN  BIT(8)

