torvalds/linux/drivers/clk/stm32/stm32mp13_rcc.h
/* RCC_MP_NS_AHB4ENCLRR register fields */
#define RCC_MP_NS_AHB4ENCLRR_GPIOAEN  BIT(0)
#define RCC_MP_NS_AHB4ENCLRR_GPIOBEN  BIT(1)
#define RCC_MP_NS_AHB4ENCLRR_GPIOCEN  BIT(2)
#define RCC_MP_NS_AHB4ENCLRR_GPIODEN  BIT(3)
#define RCC_MP_NS_AHB4ENCLRR_GPIOEEN  BIT(4)
#define RCC_MP_NS_AHB4ENCLRR_GPIOFEN  BIT(5)
#define RCC_MP_NS_AHB4ENCLRR_GPIOGEN  BIT(6)
#define RCC_MP_NS_AHB4ENCLRR_GPIOHEN  BIT(7)
#define RCC_MP_NS_AHB4ENCLRR_GPIOIEN  BIT(8)

/* RCC_MP_AHB5ENSETR register fields */
#define RCC_MP_AHB5ENSETR_PKAEN   BIT(2)
#define RCC_MP_AHB5ENSETR_SAESEN  BIT(3)
#define RCC_MP_AHB5ENSETR_CRYP1EN BIT(4)
#define RCC_MP_AHB5ENSETR_HASH1EN BIT(5)
#define RCC_MP_AHB5ENSETR_RNG1EN  BIT(6)
#define RCC_MP_AHB5ENSETR_BKPSRAMEN BIT(8)
#define RCC_MP_AHB5ENSETR_AXIMCEN BIT(16)

/* RCC_MP_AHB5ENCLRR register fields */
#define RCC_MP_AHB5ENCLRR_PKAEN   BIT(2)
#define RCC_MP_AHB5ENCLRR_SAESEN  BIT(3)
#define RCC_MP_AHB5ENCLRR_CRYP1EN BIT(4)
#define RCC_MP_AHB5ENCLRR_HASH1EN BIT(5)
#define RCC_MP_AHB5ENCLRR_RNG1EN  BIT(6)
#define RCC_MP_AHB5ENCLRR_BKPSRAMEN BIT(8)
#define RCC_MP_AHB5ENCLRR_AXIMCEN BIT(16)

/* RCC_MP_AHB6ENSETR register fields */
#define RCC_MP_AHB6ENSETR_MCEEN   BIT(1)
#define RCC_MP_AHB6ENSETR_ETH1CKEN  BIT(7)
#define RCC_MP_AHB6ENSETR_ETH1TXEN  BIT(8)
#define RCC_MP_AHB6ENSETR_ETH1RXEN  BIT(9)
#define RCC_MP_AHB6ENSETR_ETH1MACEN BIT(10)
#define RCC_MP_AHB6ENSETR_FMCEN   BIT(12)
#define RCC_MP_AHB6ENSETR_QSPIEN  BIT(14)
#define RCC_MP_AHB6ENSETR_SDMMC1EN  BIT(16)
#define RCC_MP_AHB6ENSETR_SDMMC2EN  BIT(17)
#define RCC_MP_AHB6ENSETR_CRC1EN  BIT(20)
#define RCC_MP_AHB6ENSETR_USBHEN  BIT(24)
#define RCC_MP_AHB6ENSETR_ETH2CKEN  BIT(27)
#define RCC_MP_AHB6ENSETR_ETH2TXEN  BIT(28)
#define RCC_MP_AHB6ENSETR_ETH2RXEN  BIT(29)
#define RCC_MP_AHB6ENSETR_ETH2MACEN BIT(30)

/* RCC_MP_AHB6ENCLRR register fields */
#define RCC_MP_AHB6ENCLRR_MCEEN   BIT(1)
#define RCC_MP_AHB6ENCLRR_ETH1CKEN  BIT(7)
#define RCC_MP_AHB6ENCLRR_ETH1TXEN  BIT(8)
#define RCC_MP_AHB6ENCLRR_ETH1RXEN  BIT(9)
#define RCC_MP_AHB6ENCLRR_ETH1MACEN BIT(10)
#define RCC_MP_AHB6ENCLRR_FMCEN   BIT(12)
#define RCC_MP_AHB6ENCLRR_QSPIEN  BIT(14)
#define RCC_MP_AHB6ENCLRR_SDMMC1EN  BIT(16)
#define RCC_MP_AHB6ENCLRR_SDMMC2EN  BIT(17)
#define RCC_MP_AHB6ENCLRR_CRC1EN  BIT(20)
#define RCC_MP_AHB6ENCLRR_USBHEN  BIT(24)
#define RCC_MP_AHB6ENCLRR_ETH2CKEN  BIT(27)
#define RCC_MP_AHB6ENCLRR_ETH2TXEN  BIT(28)
#define RCC_MP_AHB6ENCLRR_ETH2RXEN  BIT(29)
#define RCC_MP_AHB6ENCLRR_ETH2MACEN BIT(30)

/* RCC_MP_S_AHB6ENSETR register fields */
#define RCC_MP_S_AHB6ENSETR_MDMAEN  BIT(0)

/* RCC_MP_S_AHB6ENCLRR register fields */
#define RCC_MP_S_AHB6ENCLRR_MDMAEN  BIT(0)

/* RCC_MP_NS_AHB6ENSETR register fields */
#define RCC_MP_NS_AHB6ENSETR_MDMAEN BIT(0)

/* RCC_MP_NS_AHB6ENCLRR register fields */
#define RCC_MP_NS_AHB6ENCLRR_MDMAEN BIT(0)

/* RCC_MP_APB1LPENSETR register fields */
#define RCC_MP_APB1LPENSETR_TIM2LPEN  BIT(0)
#define RCC_MP_APB1LPENSETR_TIM3LPEN  BIT(1)
#define RCC_MP_APB1LPENSETR_TIM4LPEN  BIT(2)
#define RCC_MP_APB1LPENSETR_TIM5LPEN  BIT(3)
#define RCC_MP_APB1LPENSETR_TIM6LPEN  BIT(4)
#define RCC_MP_APB1LPENSETR_TIM7LPEN  BIT(5)
#define RCC_MP_APB1LPENSETR_LPTIM1LPEN  BIT(9)
#define RCC_MP_APB1LPENSETR_SPI2LPEN  BIT(11)
#define RCC_MP_APB1LPENSETR_SPI3LPEN  BIT(12)
#define RCC_MP_APB1LPENSETR_USART3LPEN  BIT(15)
#define RCC_MP_APB1LPENSETR_UART4LPEN BIT(16)
#define RCC_MP_APB1LPENSETR_UART5LPEN BIT(17)
#define RCC_MP_APB1LPENSETR_UART7LPEN BIT(18)
#define RCC_MP_APB1LPENSETR_UART8LPEN BIT(19)
#define RCC_MP_APB1LPENSETR_I2C1LPEN  BIT(21)
#define RCC_MP_APB1LPENSETR_I2C2LPEN  BIT(22)
#define RCC_MP_APB1LPENSETR_SPDIFLPEN BIT(26)

/* RCC_MP_APB1LPENCLRR register fields */
#define RCC_MP_APB1LPENCLRR_TIM2LPEN  BIT(0)
#define RCC_MP_APB1LPENCLRR_TIM3LPEN  BIT(1)
#define RCC_MP_APB1LPENCLRR_TIM4LPEN  BIT(2)
#define RCC_MP_APB1LPENCLRR_TIM5LPEN  BIT(3)
#define RCC_MP_APB1LPENCLRR_TIM6LPEN  BIT(4)
#define RCC_MP_APB1LPENCLRR_TIM7LPEN  BIT(5)
#define RCC_MP_APB1LPENCLRR_LPTIM1LPEN  BIT(9)
#define RCC_MP_APB1LPENCLRR_SPI2LPEN  BIT(11)
#define RCC_MP_APB1LPENCLRR_SPI3LPEN  BIT(12)
#define RCC_MP_APB1LPENCLRR_USART3LPEN  BIT(15)
#define RCC_MP_APB1LPENCLRR_UART4LPEN BIT(16)
#define RCC_MP_APB1LPENCLRR_UART5LPEN BIT(17)
#define RCC_MP_APB1LPENCLRR_UART7LPEN BIT(18)
#define RCC_MP_APB1LPENCLRR_UART8LPEN BIT(19)
#define RCC_MP_APB1LPENCLRR_I2C1LPEN  BIT(21)
#define RCC_MP_APB1LPENCLRR_I2C2LPEN  BIT(22)
#define RCC_MP_APB1LPENCLRR_SPDIFLPEN BIT(26)

/* RCC_MP_APB2LPENSETR register fields */
#define RCC_MP_APB2LPENSETR_TIM1LPEN  BIT(0)
#define RCC_MP_APB2LPENSETR_TIM8LPEN  BIT(1)
#define RCC_MP_APB2LPENSETR_SPI1LPEN  BIT(8)
#define RCC_MP_APB2LPENSETR_USART6LPEN  BIT(13)
#define RCC_MP_APB2LPENSETR_SAI1LPEN  BIT(16)
#define RCC_MP_APB2LPENSETR_SAI2LPEN  BIT(17)
#define RCC_MP_APB2LPENSETR_DFSDMLPEN BIT(20)
#define RCC_MP_APB2LPENSETR_ADFSDMLPEN  BIT(21)
#define RCC_MP_APB2LPENSETR_FDCANLPEN BIT(24)

/* RCC_MP_APB2LPENCLRR register fields */
#define RCC_MP_APB2LPENCLRR_TIM1LPEN  BIT(0)
#define RCC_MP_APB2LPENCLRR_TIM8LPEN  BIT(1)
#define RCC_MP_APB2LPENCLRR_SPI1LPEN  BIT(8)
#define RCC_MP_APB2LPENCLRR_USART6LPEN  BIT(13)
#define RCC_MP_APB2LPENCLRR_SAI1LPEN  BIT(16)
#define RCC_MP_APB2LPENCLRR_SAI2LPEN  BIT(17)
#define RCC_MP_APB2LPENCLRR_DFSDMLPEN BIT(20)
#define RCC_MP_APB2LPENCLRR_ADFSDMLPEN  BIT(21)
#define RCC_MP_APB2LPENCLRR_FDCANLPEN BIT(24)

/* RCC_MP_APB3LPENSETR register fields */
#define RCC_MP_APB3LPENSETR_LPTIM2LPEN  BIT(0)
#define RCC_MP_APB3LPENSETR_LPTIM3LPEN  BIT(1)
#define RCC_MP_APB3LPENSETR_LPTIM4LPEN  BIT(2)
#define RCC_MP_APB3LPENSETR_LPTIM5LPEN  BIT(3)
#define RCC_MP_APB3LPENSETR_VREFLPEN  BIT(13)
#define RCC_MP_APB3LPENSETR_DTSLPEN BIT(16)
#define RCC_MP_APB3LPENSETR_PMBCTRLLPEN BIT(17)

/* RCC_MP_APB3LPENCLRR register fields */
#define RCC_MP_APB3LPENCLRR_LPTIM2LPEN  BIT(0)
#define RCC_MP_APB3LPENCLRR_LPTIM3LPEN  BIT(1)
#define RCC_MP_APB3LPENCLRR_LPTIM4LPEN  BIT(2)
#define RCC_MP_APB3LPENCLRR_LPTIM5LPEN  BIT(3)
#define RCC_MP_APB3LPENCLRR_VREFLPEN  BIT(13)
#define RCC_MP_APB3LPENCLRR_DTSLPEN BIT(16)
#define RCC_MP_APB3LPENCLRR_PMBCTRLLPEN BIT(17)

/* RCC_MP_S_APB3LPENSETR register fields */
#define RCC_MP_S_APB3LPENSETR_SYSCFGLPEN  BIT(0)

