torvalds/linux/drivers/clk/stm32/stm32mp13_rcc.h
/* RCC_MP_S_APB3LPENCLRR register fields */
#define RCC_MP_S_APB3LPENCLRR_SYSCFGLPEN  BIT(0)

/* RCC_MP_NS_APB3LPENSETR register fields */
#define RCC_MP_NS_APB3LPENSETR_SYSCFGLPEN BIT(0)

/* RCC_MP_NS_APB3LPENCLRR register fields */
#define RCC_MP_NS_APB3LPENCLRR_SYSCFGLPEN BIT(0)

/* RCC_MP_APB4LPENSETR register fields */
#define RCC_MP_APB4LPENSETR_DCMIPPLPEN    BIT(1)
#define RCC_MP_APB4LPENSETR_DDRPERFMLPEN  BIT(8)
#define RCC_MP_APB4LPENSETR_IWDG2APBLPEN  BIT(15)
#define RCC_MP_APB4LPENSETR_USBPHYLPEN    BIT(16)
#define RCC_MP_APB4LPENSETR_STGENROLPEN   BIT(20)
#define RCC_MP_APB4LPENSETR_STGENROSTPEN  BIT(21)

/* RCC_MP_APB4LPENCLRR register fields */
#define RCC_MP_APB4LPENCLRR_DCMIPPLPEN    BIT(1)
#define RCC_MP_APB4LPENCLRR_DDRPERFMLPEN  BIT(8)
#define RCC_MP_APB4LPENCLRR_IWDG2APBLPEN  BIT(15)
#define RCC_MP_APB4LPENCLRR_USBPHYLPEN    BIT(16)
#define RCC_MP_APB4LPENCLRR_STGENROLPEN   BIT(20)
#define RCC_MP_APB4LPENCLRR_STGENROSTPEN  BIT(21)

/* RCC_MP_S_APB4LPENSETR register fields */
#define RCC_MP_S_APB4LPENSETR_LTDCLPEN  BIT(0)

/* RCC_MP_S_APB4LPENCLRR register fields */
#define RCC_MP_S_APB4LPENCLRR_LTDCLPEN  BIT(0)

/* RCC_MP_NS_APB4LPENSETR register fields */
#define RCC_MP_NS_APB4LPENSETR_LTDCLPEN BIT(0)

/* RCC_MP_NS_APB4LPENCLRR register fields */
#define RCC_MP_NS_APB4LPENCLRR_LTDCLPEN BIT(0)

/* RCC_MP_APB5LPENSETR register fields */
#define RCC_MP_APB5LPENSETR_RTCAPBLPEN    BIT(8)
#define RCC_MP_APB5LPENSETR_TZCLPEN   BIT(11)
#define RCC_MP_APB5LPENSETR_ETZPCLPEN   BIT(13)
#define RCC_MP_APB5LPENSETR_IWDG1APBLPEN  BIT(15)
#define RCC_MP_APB5LPENSETR_BSECLPEN    BIT(16)
#define RCC_MP_APB5LPENSETR_STGENCLPEN    BIT(20)
#define RCC_MP_APB5LPENSETR_STGENCSTPEN   BIT(21)

/* RCC_MP_APB5LPENCLRR register fields */
#define RCC_MP_APB5LPENCLRR_RTCAPBLPEN    BIT(8)
#define RCC_MP_APB5LPENCLRR_TZCLPEN   BIT(11)
#define RCC_MP_APB5LPENCLRR_ETZPCLPEN   BIT(13)
#define RCC_MP_APB5LPENCLRR_IWDG1APBLPEN  BIT(15)
#define RCC_MP_APB5LPENCLRR_BSECLPEN    BIT(16)
#define RCC_MP_APB5LPENCLRR_STGENCLPEN    BIT(20)
#define RCC_MP_APB5LPENCLRR_STGENCSTPEN   BIT(21)

/* RCC_MP_APB6LPENSETR register fields */
#define RCC_MP_APB6LPENSETR_USART1LPEN  BIT(0)
#define RCC_MP_APB6LPENSETR_USART2LPEN  BIT(1)
#define RCC_MP_APB6LPENSETR_SPI4LPEN  BIT(2)
#define RCC_MP_APB6LPENSETR_SPI5LPEN  BIT(3)
#define RCC_MP_APB6LPENSETR_I2C3LPEN  BIT(4)
#define RCC_MP_APB6LPENSETR_I2C4LPEN  BIT(5)
#define RCC_MP_APB6LPENSETR_I2C5LPEN  BIT(6)
#define RCC_MP_APB6LPENSETR_TIM12LPEN BIT(7)
#define RCC_MP_APB6LPENSETR_TIM13LPEN BIT(8)
#define RCC_MP_APB6LPENSETR_TIM14LPEN BIT(9)
#define RCC_MP_APB6LPENSETR_TIM15LPEN BIT(10)
#define RCC_MP_APB6LPENSETR_TIM16LPEN BIT(11)
#define RCC_MP_APB6LPENSETR_TIM17LPEN BIT(12)

/* RCC_MP_APB6LPENCLRR register fields */
#define RCC_MP_APB6LPENCLRR_USART1LPEN  BIT(0)
#define RCC_MP_APB6LPENCLRR_USART2LPEN  BIT(1)
#define RCC_MP_APB6LPENCLRR_SPI4LPEN  BIT(2)
#define RCC_MP_APB6LPENCLRR_SPI5LPEN  BIT(3)
#define RCC_MP_APB6LPENCLRR_I2C3LPEN  BIT(4)
#define RCC_MP_APB6LPENCLRR_I2C4LPEN  BIT(5)
#define RCC_MP_APB6LPENCLRR_I2C5LPEN  BIT(6)
#define RCC_MP_APB6LPENCLRR_TIM12LPEN BIT(7)
#define RCC_MP_APB6LPENCLRR_TIM13LPEN BIT(8)
#define RCC_MP_APB6LPENCLRR_TIM14LPEN BIT(9)
#define RCC_MP_APB6LPENCLRR_TIM15LPEN BIT(10)
#define RCC_MP_APB6LPENCLRR_TIM16LPEN BIT(11)
#define RCC_MP_APB6LPENCLRR_TIM17LPEN BIT(12)

/* RCC_MP_AHB2LPENSETR register fields */
#define RCC_MP_AHB2LPENSETR_DMA1LPEN  BIT(0)
#define RCC_MP_AHB2LPENSETR_DMA2LPEN  BIT(1)
#define RCC_MP_AHB2LPENSETR_DMAMUX1LPEN BIT(2)
#define RCC_MP_AHB2LPENSETR_DMA3LPEN  BIT(3)
#define RCC_MP_AHB2LPENSETR_DMAMUX2LPEN BIT(4)
#define RCC_MP_AHB2LPENSETR_ADC1LPEN  BIT(5)
#define RCC_MP_AHB2LPENSETR_ADC2LPEN  BIT(6)
#define RCC_MP_AHB2LPENSETR_USBOLPEN  BIT(8)

/* RCC_MP_AHB2LPENCLRR register fields */
#define RCC_MP_AHB2LPENCLRR_DMA1LPEN  BIT(0)
#define RCC_MP_AHB2LPENCLRR_DMA2LPEN  BIT(1)
#define RCC_MP_AHB2LPENCLRR_DMAMUX1LPEN BIT(2)
#define RCC_MP_AHB2LPENCLRR_DMA3LPEN  BIT(3)
#define RCC_MP_AHB2LPENCLRR_DMAMUX2LPEN BIT(4)
#define RCC_MP_AHB2LPENCLRR_ADC1LPEN  BIT(5)
#define RCC_MP_AHB2LPENCLRR_ADC2LPEN  BIT(6)
#define RCC_MP_AHB2LPENCLRR_USBOLPEN  BIT(8)

/* RCC_MP_AHB4LPENSETR register fields */
#define RCC_MP_AHB4LPENSETR_TSCLPEN BIT(15)

/* RCC_MP_AHB4LPENCLRR register fields */
#define RCC_MP_AHB4LPENCLRR_TSCLPEN BIT(15)

/* RCC_MP_S_AHB4LPENSETR register fields */
#define RCC_MP_S_AHB4LPENSETR_GPIOALPEN BIT(0)
#define RCC_MP_S_AHB4LPENSETR_GPIOBLPEN BIT(1)
#define RCC_MP_S_AHB4LPENSETR_GPIOCLPEN BIT(2)
#define RCC_MP_S_AHB4LPENSETR_GPIODLPEN BIT(3)
#define RCC_MP_S_AHB4LPENSETR_GPIOELPEN BIT(4)
#define RCC_MP_S_AHB4LPENSETR_GPIOFLPEN BIT(5)
#define RCC_MP_S_AHB4LPENSETR_GPIOGLPEN BIT(6)
#define RCC_MP_S_AHB4LPENSETR_GPIOHLPEN BIT(7)
#define RCC_MP_S_AHB4LPENSETR_GPIOILPEN BIT(8)

/* RCC_MP_S_AHB4LPENCLRR register fields */
#define RCC_MP_S_AHB4LPENCLRR_GPIOALPEN BIT(0)
#define RCC_MP_S_AHB4LPENCLRR_GPIOBLPEN BIT(1)
#define RCC_MP_S_AHB4LPENCLRR_GPIOCLPEN BIT(2)
#define RCC_MP_S_AHB4LPENCLRR_GPIODLPEN BIT(3)
#define RCC_MP_S_AHB4LPENCLRR_GPIOELPEN BIT(4)
#define RCC_MP_S_AHB4LPENCLRR_GPIOFLPEN BIT(5)
#define RCC_MP_S_AHB4LPENCLRR_GPIOGLPEN BIT(6)
#define RCC_MP_S_AHB4LPENCLRR_GPIOHLPEN BIT(7)
#define RCC_MP_S_AHB4LPENCLRR_GPIOILPEN BIT(8)

/* RCC_MP_NS_AHB4LPENSETR register fields */
#define RCC_MP_NS_AHB4LPENSETR_GPIOALPEN BIT(0)
#define RCC_MP_NS_AHB4LPENSETR_GPIOBLPEN BIT(1)
#define RCC_MP_NS_AHB4LPENSETR_GPIOCLPEN BIT(2)
#define RCC_MP_NS_AHB4LPENSETR_GPIODLPEN BIT(3)
#define RCC_MP_NS_AHB4LPENSETR_GPIOELPEN BIT(4)
#define RCC_MP_NS_AHB4LPENSETR_GPIOFLPEN BIT(5)
#define RCC_MP_NS_AHB4LPENSETR_GPIOGLPEN BIT(6)
#define RCC_MP_NS_AHB4LPENSETR_GPIOHLPEN BIT(7)
#define RCC_MP_NS_AHB4LPENSETR_GPIOILPEN BIT(8)

/* RCC_MP_NS_AHB4LPENCLRR register fields */
#define RCC_MP_NS_AHB4LPENCLRR_GPIOALPEN BIT(0)
#define RCC_MP_NS_AHB4LPENCLRR_GPIOBLPEN BIT(1)
#define RCC_MP_NS_AHB4LPENCLRR_GPIOCLPEN BIT(2)
#define RCC_MP_NS_AHB4LPENCLRR_GPIODLPEN BIT(3)
#define RCC_MP_NS_AHB4LPENCLRR_GPIOELPEN BIT(4)
#define RCC_MP_NS_AHB4LPENCLRR_GPIOFLPEN BIT(5)
#define RCC_MP_NS_AHB4LPENCLRR_GPIOGLPEN BIT(6)
#define RCC_MP_NS_AHB4LPENCLRR_GPIOHLPEN BIT(7)
#define RCC_MP_NS_AHB4LPENCLRR_GPIOILPEN BIT(8)

