torvalds/linux/drivers/clk/stm32/stm32mp13_rcc.h
/* RCC_MP_AHB5LPENSETR register fields */
#define RCC_MP_AHB5LPENSETR_PKALPEN BIT(2)
#define RCC_MP_AHB5LPENSETR_SAESLPEN  BIT(3)
#define RCC_MP_AHB5LPENSETR_CRYP1LPEN BIT(4)
#define RCC_MP_AHB5LPENSETR_HASH1LPEN BIT(5)
#define RCC_MP_AHB5LPENSETR_RNG1LPEN  BIT(6)
#define RCC_MP_AHB5LPENSETR_BKPSRAMLPEN BIT(8)

/* RCC_MP_AHB5LPENCLRR register fields */
#define RCC_MP_AHB5LPENCLRR_PKALPEN BIT(2)
#define RCC_MP_AHB5LPENCLRR_SAESLPEN  BIT(3)
#define RCC_MP_AHB5LPENCLRR_CRYP1LPEN BIT(4)
#define RCC_MP_AHB5LPENCLRR_HASH1LPEN BIT(5)
#define RCC_MP_AHB5LPENCLRR_RNG1LPEN  BIT(6)
#define RCC_MP_AHB5LPENCLRR_BKPSRAMLPEN BIT(8)

/* RCC_MP_AHB6LPENSETR register fields */
#define RCC_MP_AHB6LPENSETR_MCELPEN BIT(1)
#define RCC_MP_AHB6LPENSETR_ETH1CKLPEN  BIT(7)
#define RCC_MP_AHB6LPENSETR_ETH1TXLPEN  BIT(8)
#define RCC_MP_AHB6LPENSETR_ETH1RXLPEN  BIT(9)
#define RCC_MP_AHB6LPENSETR_ETH1MACLPEN BIT(10)
#define RCC_MP_AHB6LPENSETR_ETH1STPEN BIT(11)
#define RCC_MP_AHB6LPENSETR_FMCLPEN BIT(12)
#define RCC_MP_AHB6LPENSETR_QSPILPEN  BIT(14)
#define RCC_MP_AHB6LPENSETR_SDMMC1LPEN  BIT(16)
#define RCC_MP_AHB6LPENSETR_SDMMC2LPEN  BIT(17)
#define RCC_MP_AHB6LPENSETR_CRC1LPEN  BIT(20)
#define RCC_MP_AHB6LPENSETR_USBHLPEN  BIT(24)
#define RCC_MP_AHB6LPENSETR_ETH2CKLPEN  BIT(27)
#define RCC_MP_AHB6LPENSETR_ETH2TXLPEN  BIT(28)
#define RCC_MP_AHB6LPENSETR_ETH2RXLPEN  BIT(29)
#define RCC_MP_AHB6LPENSETR_ETH2MACLPEN BIT(30)
#define RCC_MP_AHB6LPENSETR_ETH2STPEN BIT(31)

/* RCC_MP_AHB6LPENCLRR register fields */
#define RCC_MP_AHB6LPENCLRR_MCELPEN BIT(1)
#define RCC_MP_AHB6LPENCLRR_ETH1CKLPEN  BIT(7)
#define RCC_MP_AHB6LPENCLRR_ETH1TXLPEN  BIT(8)
#define RCC_MP_AHB6LPENCLRR_ETH1RXLPEN  BIT(9)
#define RCC_MP_AHB6LPENCLRR_ETH1MACLPEN BIT(10)
#define RCC_MP_AHB6LPENCLRR_ETH1STPEN BIT(11)
#define RCC_MP_AHB6LPENCLRR_FMCLPEN BIT(12)
#define RCC_MP_AHB6LPENCLRR_QSPILPEN  BIT(14)
#define RCC_MP_AHB6LPENCLRR_SDMMC1LPEN  BIT(16)
#define RCC_MP_AHB6LPENCLRR_SDMMC2LPEN  BIT(17)
#define RCC_MP_AHB6LPENCLRR_CRC1LPEN  BIT(20)
#define RCC_MP_AHB6LPENCLRR_USBHLPEN  BIT(24)
#define RCC_MP_AHB6LPENCLRR_ETH2CKLPEN  BIT(27)
#define RCC_MP_AHB6LPENCLRR_ETH2TXLPEN  BIT(28)
#define RCC_MP_AHB6LPENCLRR_ETH2RXLPEN  BIT(29)
#define RCC_MP_AHB6LPENCLRR_ETH2MACLPEN BIT(30)
#define RCC_MP_AHB6LPENCLRR_ETH2STPEN BIT(31)

/* RCC_MP_S_AHB6LPENSETR register fields */
#define RCC_MP_S_AHB6LPENSETR_MDMALPEN  BIT(0)

/* RCC_MP_S_AHB6LPENCLRR register fields */
#define RCC_MP_S_AHB6LPENCLRR_MDMALPEN  BIT(0)

/* RCC_MP_NS_AHB6LPENSETR register fields */
#define RCC_MP_NS_AHB6LPENSETR_MDMALPEN BIT(0)

/* RCC_MP_NS_AHB6LPENCLRR register fields */
#define RCC_MP_NS_AHB6LPENCLRR_MDMALPEN BIT(0)

/* RCC_MP_S_AXIMLPENSETR register fields */
#define RCC_MP_S_AXIMLPENSETR_SYSRAMLPEN BIT(0)

/* RCC_MP_S_AXIMLPENCLRR register fields */
#define RCC_MP_S_AXIMLPENCLRR_SYSRAMLPEN BIT(0)

/* RCC_MP_NS_AXIMLPENSETR register fields */
#define RCC_MP_NS_AXIMLPENSETR_SYSRAMLPEN BIT(0)

/* RCC_MP_NS_AXIMLPENCLRR register fields */
#define RCC_MP_NS_AXIMLPENCLRR_SYSRAMLPEN BIT(0)

/* RCC_MP_MLAHBLPENSETR register fields */
#define RCC_MP_MLAHBLPENSETR_SRAM1LPEN  BIT(0)
#define RCC_MP_MLAHBLPENSETR_SRAM2LPEN  BIT(1)
#define RCC_MP_MLAHBLPENSETR_SRAM3LPEN  BIT(2)

/* RCC_MP_MLAHBLPENCLRR register fields */
#define RCC_MP_MLAHBLPENCLRR_SRAM1LPEN  BIT(0)
#define RCC_MP_MLAHBLPENCLRR_SRAM2LPEN  BIT(1)
#define RCC_MP_MLAHBLPENCLRR_SRAM3LPEN  BIT(2)

/* RCC_APB3SECSR register fields */
#define RCC_APB3SECSR_LPTIM2SECF  0
#define RCC_APB3SECSR_LPTIM3SECF  1
#define RCC_APB3SECSR_VREFSECF    13

/* RCC_APB4SECSR register fields */
#define RCC_APB4SECSR_DCMIPPSECF  1
#define RCC_APB4SECSR_USBPHYSECF  16

/* RCC_APB5SECSR register fields */
#define RCC_APB5SECSR_RTCSECF   8
#define RCC_APB5SECSR_TZCSECF   11
#define RCC_APB5SECSR_ETZPCSECF   13
#define RCC_APB5SECSR_IWDG1SECF   15
#define RCC_APB5SECSR_BSECSECF    16
#define RCC_APB5SECSR_STGENCSECF_MASK GENMASK(21, 20)
#define RCC_APB5SECSR_STGENCSECF  20
#define RCC_APB5SECSR_STGENROSECF 21

/* RCC_APB6SECSR register fields */
#define RCC_APB6SECSR_USART1SECF        0
#define RCC_APB6SECSR_USART2SECF  1
#define RCC_APB6SECSR_SPI4SECF    2
#define RCC_APB6SECSR_SPI5SECF    3
#define RCC_APB6SECSR_I2C3SECF    4
#define RCC_APB6SECSR_I2C4SECF    5
#define RCC_APB6SECSR_I2C5SECF    6
#define RCC_APB6SECSR_TIM12SECF   7
#define RCC_APB6SECSR_TIM13SECF   8
#define RCC_APB6SECSR_TIM14SECF   9
#define RCC_APB6SECSR_TIM15SECF   10
#define RCC_APB6SECSR_TIM16SECF   11
#define RCC_APB6SECSR_TIM17SECF   12

/* RCC_AHB2SECSR register fields */
#define RCC_AHB2SECSR_DMA3SECF    3
#define RCC_AHB2SECSR_DMAMUX2SECF 4
#define RCC_AHB2SECSR_ADC1SECF    5
#define RCC_AHB2SECSR_ADC2SECF    6
#define RCC_AHB2SECSR_USBOSECF    8

/* RCC_AHB4SECSR register fields */
#define RCC_AHB4SECSR_TSCSECF   15

/* RCC_AHB5SECSR register fields */
#define RCC_AHB5SECSR_PKASECF   2
#define RCC_AHB5SECSR_SAESSECF    3
#define RCC_AHB5SECSR_CRYP1SECF   4
#define RCC_AHB5SECSR_HASH1SECF   5
#define RCC_AHB5SECSR_RNG1SECF    6
#define RCC_AHB5SECSR_BKPSRAMSECF 8

/* RCC_AHB6SECSR register fields */
#define RCC_AHB6SECSR_MCESECF   1
#define RCC_AHB6SECSR_FMCSECF   12
#define RCC_AHB6SECSR_QSPISECF    14
#define RCC_AHB6SECSR_SDMMC1SECF  16
#define RCC_AHB6SECSR_SDMMC2SECF  17

#define RCC_AHB6SECSR_ETH1SECF_MASK GENMASK(11, 7)
#define RCC_AHB6SECSR_ETH2SECF_MASK GENMASK(31, 27)
#define RCC_AHB6SECSR_ETH1SECF_SHIFT  7
#define RCC_AHB6SECSR_ETH2SECF_SHIFT  27

#define RCC_AHB6SECSR_ETH1CKSECF  7
#define RCC_AHB6SECSR_ETH1TXSECF  8
#define RCC_AHB6SECSR_ETH1RXSECF  9
#define RCC_AHB6SECSR_ETH1MACSECF 10
#define RCC_AHB6SECSR_ETH1STPSECF 11

#define RCC_AHB6SECSR_ETH2CKSECF  27
#define RCC_AHB6SECSR_ETH2TXSECF  28
#define RCC_AHB6SECSR_ETH2RXSECF  29
#define RCC_AHB6SECSR_ETH2MACSECF 30
#define RCC_AHB6SECSR_ETH2STPSECF 31

/* RCC_VERR register fields */
#define RCC_VERR_MINREV_MASK    GENMASK(3, 0)
#define RCC_VERR_MAJREV_MASK    GENMASK(7, 4)
#define RCC_VERR_MINREV_SHIFT   0
#define RCC_VERR_MAJREV_SHIFT   4

/* RCC_IDR register fields */
#define RCC_IDR_ID_MASK     GENMASK(31, 0)
#define RCC_IDR_ID_SHIFT    0

/* RCC_SIDR register fields */
#define RCC_SIDR_SID_MASK   GENMASK(31, 0)
#define RCC_SIDR_SID_SHIFT    0

#endif /* STM32MP13_RCC_H */
